Tekla Open API Reference for Tekla Structures 2025
ConicalSurface.Radiuses Property
 Gets radiuses of the conical surface. The first radius corresponds to the section located in the first point of the side boundary 1, and the second radius corresponds to the section located in the second point of the side boundary 1.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Tuple<double, double> Radiuses { get; }
Public ReadOnly Property Radiuses As Tuple(Of Double, Double)
	Get
Property Value
Type: Tuple<Double, Double>
See Also
Reference
ConicalSurface Class
Tekla.Structures.Model Namespace